# BuiltInFailures.ProfileFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ProfileFailures Class
BuiltInFailures Class Members See Also
---
Failures about Profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ProfileFailures
```

Visual Basic
---
```text
Public NotInheritable Class ProfileFailures
```

Visual C++
---
```text
public ref class ProfileFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ProfileFailures
# See Also
BuiltInFailures..::..ProfileFailures Members
Autodesk.Revit.DB Namespace